class SymptomConfig {
  const SymptomConfig._();

  static const List<String> symptoms = [
    'ปวดหัว',
    'ไข้',
    'ไข้สูง',
    'เจ็บหน้าอก',
    'ปวดท้อง',
    'ไอ เจ็บคอ',
  ];

  static const Map<String, List<String>> symptomDepartmentNames = {
    'ปวดหัว': [
      'ศูนย์สมองและระบบประสาท',
      'อายุรกรรม',
    ],
    'ไข้สูง': [
      'อายุรกรรม',
    ],
    'เจ็บหน้าอก': [
      'ศูนย์หัวใจ',
      'อายุรกรรม',
    ],
    'ปวดท้อง': [
      'อายุรกรรม',
      'ศูนย์ทางเดินอาหาร',
    ],
    'ไอ เจ็บคอ': [
      'อายุรกรรม',
    ],
    'ไข้': [
      'อายุรกรรม',
    ],
  };
}